bearxiong99/SmartCityLighting/Firmware/src/ti/source/ti/devices/cc26x0r2/inc/hw_gpio.h
// Field:    [19] DIO19
//
// Event for DIO 19
#define GPIO_EVFLAGS31_0_DIO19                                      0x00080000
#define GPIO_EVFLAGS31_0_DIO19_BITN                                         19
#define GPIO_EVFLAGS31_0_DIO19_M                                    0x00080000
#define GPIO_EVFLAGS31_0_DIO19_S                                            19

// Field:    [18] DIO18
//
// Event for DIO 18
#define GPIO_EVFLAGS31_0_DIO18                                      0x00040000
#define GPIO_EVFLAGS31_0_DIO18_BITN                                         18
#define GPIO_EVFLAGS31_0_DIO18_M                                    0x00040000
#define GPIO_EVFLAGS31_0_DIO18_S                                            18

// Field:    [17] DIO17
//
// Event for DIO 17
#define GPIO_EVFLAGS31_0_DIO17                                      0x00020000
#define GPIO_EVFLAGS31_0_DIO17_BITN                                         17
#define GPIO_EVFLAGS31_0_DIO17_M                                    0x00020000
#define GPIO_EVFLAGS31_0_DIO17_S                                            17

// Field:    [16] DIO16
//
// Event for DIO 16
#define GPIO_EVFLAGS31_0_DIO16                                      0x00010000
#define GPIO_EVFLAGS31_0_DIO16_BITN                                         16
#define GPIO_EVFLAGS31_0_DIO16_M                                    0x00010000
#define GPIO_EVFLAGS31_0_DIO16_S                                            16

// Field:    [15] DIO15
//
// Event for DIO 15
#define GPIO_EVFLAGS31_0_DIO15                                      0x00008000
#define GPIO_EVFLAGS31_0_DIO15_BITN                                         15
#define GPIO_EVFLAGS31_0_DIO15_M                                    0x00008000
#define GPIO_EVFLAGS31_0_DIO15_S                                            15

// Field:    [14] DIO14
//
// Event for DIO 14
#define GPIO_EVFLAGS31_0_DIO14                                      0x00004000
#define GPIO_EVFLAGS31_0_DIO14_BITN                                         14
#define GPIO_EVFLAGS31_0_DIO14_M                                    0x00004000
#define GPIO_EVFLAGS31_0_DIO14_S                                            14

// Field:    [13] DIO13
//
// Event for DIO 13
#define GPIO_EVFLAGS31_0_DIO13                                      0x00002000
#define GPIO_EVFLAGS31_0_DIO13_BITN                                         13
#define GPIO_EVFLAGS31_0_DIO13_M                                    0x00002000
#define GPIO_EVFLAGS31_0_DIO13_S                                            13

// Field:    [12] DIO12
//
// Event for DIO 12
#define GPIO_EVFLAGS31_0_DIO12                                      0x00001000
#define GPIO_EVFLAGS31_0_DIO12_BITN                                         12
#define GPIO_EVFLAGS31_0_DIO12_M                                    0x00001000
#define GPIO_EVFLAGS31_0_DIO12_S                                            12

// Field:    [11] DIO11
//
// Event for DIO 11
#define GPIO_EVFLAGS31_0_DIO11                                      0x00000800
#define GPIO_EVFLAGS31_0_DIO11_BITN                                         11
#define GPIO_EVFLAGS31_0_DIO11_M                                    0x00000800
#define GPIO_EVFLAGS31_0_DIO11_S                                            11

// Field:    [10] DIO10
//
// Event for DIO 10
#define GPIO_EVFLAGS31_0_DIO10                                      0x00000400
#define GPIO_EVFLAGS31_0_DIO10_BITN                                         10
#define GPIO_EVFLAGS31_0_DIO10_M                                    0x00000400
#define GPIO_EVFLAGS31_0_DIO10_S                                            10

// Field:     [9] DIO9
//
// Event for DIO 9
#define GPIO_EVFLAGS31_0_DIO9                                       0x00000200
#define GPIO_EVFLAGS31_0_DIO9_BITN                                           9
#define GPIO_EVFLAGS31_0_DIO9_M                                     0x00000200
#define GPIO_EVFLAGS31_0_DIO9_S                                              9

// Field:     [8] DIO8
//
// Event for DIO 8
#define GPIO_EVFLAGS31_0_DIO8                                       0x00000100
#define GPIO_EVFLAGS31_0_DIO8_BITN                                           8
#define GPIO_EVFLAGS31_0_DIO8_M                                     0x00000100
#define GPIO_EVFLAGS31_0_DIO8_S                                              8

// Field:     [7] DIO7
//
// Event for DIO 7
#define GPIO_EVFLAGS31_0_DIO7                                       0x00000080
#define GPIO_EVFLAGS31_0_DIO7_BITN                                           7
#define GPIO_EVFLAGS31_0_DIO7_M                                     0x00000080
#define GPIO_EVFLAGS31_0_DIO7_S                                              7

// Field:     [6] DIO6
//
// Event for DIO 6
#define GPIO_EVFLAGS31_0_DIO6                                       0x00000040
#define GPIO_EVFLAGS31_0_DIO6_BITN                                           6
#define GPIO_EVFLAGS31_0_DIO6_M                                     0x00000040
#define GPIO_EVFLAGS31_0_DIO6_S                                              6

// Field:     [5] DIO5
//
// Event for DIO 5
#define GPIO_EVFLAGS31_0_DIO5                                       0x00000020
#define GPIO_EVFLAGS31_0_DIO5_BITN                                           5
#define GPIO_EVFLAGS31_0_DIO5_M                                     0x00000020
#define GPIO_EVFLAGS31_0_DIO5_S                                              5

// Field:     [4] DIO4
//
// Event for DIO 4
#define GPIO_EVFLAGS31_0_DIO4                                       0x00000010
#define GPIO_EVFLAGS31_0_DIO4_BITN                                           4
#define GPIO_EVFLAGS31_0_DIO4_M                                     0x00000010
#define GPIO_EVFLAGS31_0_DIO4_S                                              4

// Field:     [3] DIO3
//
// Event for DIO 3
#define GPIO_EVFLAGS31_0_DIO3                                       0x00000008
#define GPIO_EVFLAGS31_0_DIO3_BITN                                           3
#define GPIO_EVFLAGS31_0_DIO3_M                                     0x00000008
#define GPIO_EVFLAGS31_0_DIO3_S                                              3

// Field:     [2] DIO2
//
// Event for DIO 2
#define GPIO_EVFLAGS31_0_DIO2                                       0x00000004
#define GPIO_EVFLAGS31_0_DIO2_BITN                                           2
#define GPIO_EVFLAGS31_0_DIO2_M                                     0x00000004
#define GPIO_EVFLAGS31_0_DIO2_S                                              2

// Field:     [1] DIO1
//
// Event for DIO 1
#define GPIO_EVFLAGS31_0_DIO1                                       0x00000002
#define GPIO_EVFLAGS31_0_DIO1_BITN                                           1
#define GPIO_EVFLAGS31_0_DIO1_M                                     0x00000002
#define GPIO_EVFLAGS31_0_DIO1_S                                              1

// Field:     [0] DIO0
//
// Event for DIO 0
#define GPIO_EVFLAGS31_0_DIO0                                       0x00000001
#define GPIO_EVFLAGS31_0_DIO0_BITN                                           0
#define GPIO_EVFLAGS31_0_DIO0_M                                     0x00000001
#define GPIO_EVFLAGS31_0_DIO0_S                                              0


#endif // __GPIO__
